Repository: Tofandel/contact-form-7-redirection
Catalog: languages/wpcf7-redirect-*.po
Languages: he_il

source: Open page in a new tab
he_il: פתח דף בלשונית חדשה

source: Notice!
he_il: שימו לב!

source: This option might not work as expected, since browsers often block popup windows. This option depends on the browser settings.
he_il: ייתכן ואפשרות זו לא תעבוד כמצופה, כיוון שדפדפנים חוסמים חלונות קופצים לעיתים קרובות. אפשרות זו תלויה בהגדרות הדפדפן.

source: Contact Form 7 Redirection
he_il: טפסי צרו קשר 7 - הפנייה לדף תודה

source: Contact Form 7 Add-on - Redirect after mail sent.
he_il: טפסי צרו קשר 7 - הפנייה לדף תודה לאחר שהטופס נשלח בהצלחה.

source: Redirect Settings
he_il: הגדרות הפנייה

source: Choose Page
he_il: בחר דף

source: Select a page to redirect to on successful form submission.
he_il: בחר דף לביצוע הפנייה לאחר שהטופס נשלח בהצלחה.

source: External URL
he_il: כתובת URL חיצונית

source: Use external URL
he_il: השתמש בכתובת URL חיצונית

source: Error: Please update Contact Form 7.
he_il: שגיאה: בבקשה עדכן את Contact Form 7.

source: Error: Please install and activate Contact Form 7.
he_il: שגיאה: בבקשה התקן והפעל את Contact Form 7.
